Autodesk.Revit.DB.FilteredElementIterator.CurrentObject
Gets the item at the current position of the iterator.(Inherited from IEnumerator. Give it another property name to avoid confusing. And make it internal.)

Autodesk.Revit.DB.FilteredElementIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.FilteredElementIterator.Reset
Resets the iterator to the beginning.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FilteredElementCollector that yielded this iterator has been reset by another operation.
No further iteration is permitted with this iterator.
Since:
2011

Autodesk.Revit.DB.FilteredElementIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if the iteration has no more matching elements.  False if there are more element ids to be iterated.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FilteredElementCollector that yielded this iterator has been reset by another operation.
No further iteration is permitted with this iterator.
Since:
2011

Autodesk.Revit.DB.FilteredElementIterator.MoveNext
Increments the iterator to the next element passing the filter.
Returns:
True if there is another available element passing the filter in this iterator.
False if the iterator has completed all available elements.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FilteredElementCollector that yielded this iterator has been reset by another operation.
No further iteration is permitted with this iterator.
-or-
The iterator cannot proceed due to changes made to the Element table in Revit's database (typically,
This can be the result of an Element deletion).
Since:
2011

Autodesk.Revit.DB.FilteredElementIterator.GetCurrent
The current element found by the iterator.
Returns:
The element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There are no more element ids in the iterator.
-or-
The FilteredElementCollector that yielded this iterator has been reset by another operation.
No further iteration is permitted with this iterator.
-or-
The iterator cannot proceed due to changes made to the Element table in Revit's database (typically,
This can be the result of an Element deletion).
Since:
2011

Autodesk.Revit.DB.FilteredElementIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FilteredElementIterator
An iterator to a set of element ids filtered by the settings of a FilteredElementCollector.
Since:
2011